basic/controllers/DonatariosController.php

    public function actionCreate()
    {
        $model = new Donatarios();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `donatarios` (`nome`, `cpfcnpj`, `telefone`, `endereco`, `email`, `senha`) VALUES ('Matheus', '11122233345', '49998117821', 'Avenida da Integração', 'abacate@gmail.com', 'abacate')

    protected function findModel($idcaddonatario)
    {
        if (($model = Donatarios::findOne(['idcaddonatario' => $idcaddonatario])) !== null) {
---
SELECT * FROM `donatarios` WHERE `idcaddonatario`='1'